/*! \file TCGInterface.hpp
    \brief TCG API definition for generic TCG Interface functions.

    This file details the interface classes and functions for writing
    client code that uses the TCG security protocol. 
    It is a C++ specific interface, implemented as an abstract class.
    
    \legal 
    All software, source code, and any additional materials contained
    herein (the "Software") are owned by Seagate Technology LLC and are 
    protected by law and international treaties.  No rights to the 
    Software, including any rights to distribute, reproduce, sell, or 
    use the Software, are granted unless a license agreement has been 
    mutually agreed to and executed between Seagate Technology LLC and 
    an authorized licensee. 

    The Software contains SEAGATE CONFIDENTIAL INFORMATION AND SEAGATE 
    TRADE SECRET INFORMATION that must be protected as such.

    Copyright © 2009.  Seagate Technology LLC  All Rights Reserved.

    The Software is provided under the Agreement No. 134849 between Seagate
    Technology and Calsoft. All Intellectual Property rights to the Software,
    as between Calsoft and Seagate, will be governed under the terms of the 
    Agreement No. 134849; no other rights to the Software are granted.

*/

#ifndef TCG_INTERFACE_DOT_HPP
#define TCG_INTERFACE_DOT_HPP

#if !defined(__cplusplus)
#error C++ compiler required.  Include files for 'C' compilers.
#endif
// !defined __cplusplus
//=================================
// Include files
//=================================
#include "../dti.hpp"
#include "TCGValues.h"

#if defined (_WIN32)
#elif defined (__DJGPP)
#elif defined (__linux__)
#else
#error "Operating system not defined!"
#endif

namespace dti
{
   //=================================================================================
   /// \brief User defined/supplied lengthy process progress update callback routine (eg., used with DataStore or MBR table read/write).
   ///
   /// \param total      [IN]  The total amount of data access of workload (in bytes) during the process.
   /// \param start      [IN]  The starting point of addressing (byte index).
   /// \param current    [IN]  The present point of addessing (byte index) to be processed.
   /// \param pace       [IN]  The length of data (interval, in bytes) for the current step.
   ///
   /// \return boolean flag indicating if the user wants to continue the process. True to continue, and false to abort.
   //=================================================================================
   typedef bool (*UserProgressUpdateCallBack)( tUINT64 total, tUINT64 start, tUINT64 current, tUINT64 pace );


   //=================================
   // struct definitions
   //=================================

   //====================================================================================
   /// \brief AuthenticationParameter structure defines pointers to authentication authority name and password.
   ///
   /// Each item of data is coupled with a state flag of validity (or length for an 
   /// array, and using -1 for invalid state), indicating
   /// - For an output (Set), whether the data is valid and will be present or omitted
   /// in the corresponding method-call invocation. Caller sets it prior to calling Set.
   /// - For an iutput (Get), whether the data is intended and will be parsed and returned
   /// from the corresponding Get-method invocation result. Get-method resets it to signal  
   /// to caller the state of availability for this data item.
   //====================================================================================
   struct AuthenticationParameter
   {
      char    * AuthorityName;   // "SID", "MSID", "EraseMaster", "BandMaster#", "Admin#", "User#", etc.
      tUINT8  * Pin;             // Pointer to a buffer of Max 32 bytes.
      tUINT8  PinLength;         // Number of bytes of the Pin.

      AuthenticationParameter( char *name =NULL, tUINT8 *pin =NULL, tUINT8 length =0 ) : AuthorityName(name), Pin(pin), PinLength(length)
      { if( NULL != pin && 0 == length ) PinLength = (tUINT8) strlen((char*)pin); } // assuming an 0-terminated ASCII string
   }; // AuthenticationParameter


   //====================================================================================
   /// \brief The following I/O data structures are for Get/Set on a few selected Object or Table row.
   ///
   /// Each item of data is coupled with a state flag (bool value is used for simplicity, though
   /// a bitmap mechanism is an alternative) of validity (or length for an array, and using -1
   /// for invalid state), indicating
   /// - For an output (Set), whether the data is valid and will be present or omitted
   /// in the corresponding method-call invocation. Caller sets it prior to calling Set.
   /// - For an iutput (Get), whether the data is intended and will be parsed and returned
   /// from the corresponding Get-method invocation result. Get-method resets it to signal  
   /// to caller the state of availability for this data item.
   //====================================================================================

   //====================================================================================
   /// \brief Data structure of selected TPer Properties for Properties() method.
   //====================================================================================
   struct TPerProperties
   {
      tUINT32  MaxComPacketSize;               // "MaxComPacketSize"          (min 1024 for Ent-SSC and 2048 for Opal)
      bool     MaxComPacketSize_isValid;

      tUINT32  MaxResponseComPacketSize;       // "MaxResponseComPacketSize"  (min 1024 for Ent-SSC and 2048 for Opal)
      bool     MaxResponseComPacketSize_isValid;

      tUINT32  MaxPacketSize;                  // "MaxPacketSize"             (min 1004 for Ent-SSC and 2028 for Opal)
      bool     MaxPacketSize_isValid;

      tUINT32  MaxIndTokenSize;                // "MaxIndTokenSize"           (min 256 for Ent-SSC and 1992 for Opal)
      bool     MaxIndTokenSize_isValid;

      tUINT32  MaxAggTokenSize;                // "MaxAggTokenSize"           
      bool     MaxAggTokenSize_isValid;

      tUINT32  MaxPackets;                     // "MaxPackets"                (min 1)
      bool     MaxPackets_isValid;

      tUINT32  MaxSubpackets;                  // "MaxSubpackets"             (min 1)
      bool     MaxSubpackets_isValid;

      tUINT32  MaxMethods;                     // "MaxMethods"                (min 1)
      bool     MaxMethods_isValid;

      tUINT16  MaxSessions;                    // "MaxSessions"               (min 2 for Ent-SSC and 1 for Opal)
      bool     MaxSessions_isValid;

      tUINT16  MaxReadSessions;                // "MaxReadSessions"           
      bool     MaxReadSessions_isValid;

      tUINT16  MaxAuthentications;             // "MaxAuthentications"        (min 1 for Ent-SSC and 2 for Opal)
      bool     MaxAuthentications_isValid;

      tUINT16  MaxTransactionLimit;            // "MaxTransactionLimit"       (min 1)
      bool     MaxTransactionLimit_isValid;

      tUINT64  DefSessionTimeout;              // "DefSessionTimeout"     
      bool     DefSessionTimeout_isValid;

      tUINT64  MaxSessionTimeout;              // "MaxSessionTimeout"     
      bool     MaxSessionTimeout_isValid;

      tUINT64  MinSessionTimeout;              // "MinSessionTimeout"     
      bool     MinSessionTimeout_isValid;

      tUINT32  DefTransTimeout;                // "DefTransTimeout"     
      bool     DefTransTimeout_isValid;

      tUINT32  MaxTransTimeout;                // "MaxTransTimeout"     
      bool     MaxTransTimeout_isValid;

      tUINT32  MinTransTimeout;                // "MinTransTimeout"     
      bool     MinTransTimeout_isValid;

      tUINT64  MaxComIDTime;                   // "MaxComIDTime"     
      bool     MaxComIDTime_isValid;

      tUINT32  MaxComIDCMD;                    // "MaxComIDCMD"     
      bool     MaxComIDCMD_isValid;

      bool     ContinuedTokens;                // "ContinuedTokens"     
      bool     ContinuedTokens_isValid;

      bool     SequenceNumbers;                // "SequenceNumbers"     
      bool     SequenceNumbers_isValid;

      bool     AckNak;                         // "AckNak"     
      bool     AckNak_isValid;

      bool     Asynchronous;                   // "Asynchronous"     
      bool     Asynchronous_isValid;

      bool     RealTimeClock;                  // "RealTimeClock"     
      bool     RealTimeClock_isValid;

      TPerProperties( bool toGet =true ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // TPerProperties

   //====================================================================================
   /// \brief Data structure of selected Host Properties for Properties() method.
   //====================================================================================
   struct HostProperties
   {
      tUINT32  MaxComPacketSize;               // "MaxComPacketSize"          (min 1024 for Ent-SSC and 2048 for Opal)
      bool     MaxComPacketSize_isValid;

      tUINT32  MaxResponseComPacketSize;       // "MaxResponseComPacketSize"  (min 1024 for Ent-SSC and 2048 for Opal)
      bool     MaxResponseComPacketSize_isValid;

      tUINT32  MaxPacketSize;                  // "MaxPacketSize"             (min 1004 for Ent-SSC and 2028 for Opal)
      bool     MaxPacketSize_isValid;

      tUINT32  MaxIndTokenSize;                // "MaxIndTokenSize"           (min 256 for Ent-SSC and 1992 for Opal)
      bool     MaxIndTokenSize_isValid;

      tUINT32  MaxAggTokenSize;                // "MaxAggTokenSize"           
      bool     MaxAggTokenSize_isValid;

      tUINT32  MaxPackets;                     // "MaxPackets"                (min 1)
      bool     MaxPackets_isValid;

      tUINT32  MaxSubpackets;                  // "MaxSubpackets"             (min 1)
      bool     MaxSubpackets_isValid;

      tUINT32  MaxMethods;                     // "MaxMethods"                (min 1)
      bool     MaxMethods_isValid;

      bool     ContinuedTokens;                // "ContinuedTokens"     
      bool     ContinuedTokens_isValid;

      bool     SequenceNumbers;                // "SequenceNumbers"     
      bool     SequenceNumbers_isValid;

      bool     AckNak;                         // "AckNak"     
      bool     AckNak_isValid;

      bool     Asynchronous;                   // "Asynchronous"     
      bool     Asynchronous_isValid;

      HostProperties( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // HostProperties

   //====================================================================================
   /// \brief Data structure of selected columns from table SP row.
   //====================================================================================
   struct IOTableSP
   {
      TCG_UID  UID;                    // 00  - "UID"          (Read Only)
      bool     UID_isValid;

      tUINT8   Name[33];               // 01  - "Name"         (Read Only, max 32 bytes, 0-terminated)
      tINT8    Name_length;

      TCG_UID  ORG;                    // 02  - "ORG"          (Read Only)
      bool     ORG_isValid;

      tUINT8   EffectiveAuth[32];      // 03  - "EffectiveAuth" (Read Only, 32-bytes)
      tINT8    EffectiveAuth_isValid;

      tUINT16  DateofIssue_Year;       // 04  - "DateofIssue"  (Read Only)
      tUINT8   DateofIssue_Month;      // 04  - "DateofIssue"  (Read Only)
      tUINT8   DateofIssue_Day;        // 04  - "DateofIssue"  (Read Only)
      bool     DateofIssue_isValid;

      tUINT64  Bytes;                  // 05  - "Bytes"        (Read Only)
      bool     Bytes_isValid;

      tUINT8   LifeCycleState;         // 06  - "LifeCycleState" (Read Only, 0-15)
      bool     LifeCycleState_isValid;

      bool     Frozen;                 // 07  - "Frozen"
      bool     Frozen_isValid;

      IOTableSP( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTableSP

   //====================================================================================
   /// \brief Data structure of selected columns from table LockingInfo row.
   //====================================================================================
   struct IOTableLockingInfo
   {
      TCG_UID  UID;                    // 00  - "UID"        (Read Only)
      bool     UID_isValid;

      tUINT8   Name[33];               // 01  - "Name"       (Read Only, max 32 bytes, 0-terminated)
      tINT8    Name_length;

      tUINT32  Version;                // 02  - "Version"    (Read Only)
      bool     Version_isValid;

      tUINT8   EncryptSupport;         // 03  - "EncryptSupport" (Read Only, 0-15)
      bool     EncryptSupport_isValid;

      tUINT32  MaxRanges;              // 04  - "MaxRanges"  (Read Only)
      bool     MaxRanges_isValid;

      tUINT32  MaxReEncryptions;       // 05  - "MaxReEncryptions"  (Read Only)
      bool     MaxReEncryptions_isValid;

      tUINT8   KeysAvailableCfg;       // 06  - "KeysAvailableCfg" (Read Only, 0-7)
      bool     KeysAvailableCfg_isValid;

      TCG_UIDs SingleUserModeRanges;   // 07  - "SingleUserModeRanges" (Read Only, 0-max LockingObject/Table UIDs)
      tINT8    SingleUserModeRanges_isValid;

      tUINT8   RangeStartLengthPolicy; // 08  - "RangeStartLengthPolicy" (Read Only, 0-7, currently only 0 or 1 used)
      bool     RangeStartLengthPolicy_isValid;

      IOTableLockingInfo( bool toGet =true ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTableLockingInfo

   //====================================================================================
   /// \brief Data structure of selected columns from table Locking row.
   //====================================================================================
   struct IOTableLocking
   {
      TCG_UID  UID;                    // 00  - "UID"        (Read Only)
      bool     UID_isValid;

      tUINT8   Name[33];               // 01  - "Name"       (Read Only, max 32 bytes, 0-terminated)
      tINT8    Name_length;

      tUINT8   CommonName[33];         // 02  - "CommonName" (max 32 bytes, 0-terminated)
      tINT8    CommonName_length;

      tUINT64  RangeStart;             // 03  - "RangeStart"
      bool     RangeStart_isValid;

      tUINT64  RangeLength;            // 04  - "RangeLength"
      bool     RangeLength_isValid;

      bool     ReadLockEnabled;        // 05  - "ReadLockEnabled"
      bool     ReadLockEnabled_isValid;

      bool     WriteLockEnabled;       // 06  - "WriteLockEnabled"
      bool     WriteLockEnabled_isValid;

      bool     ReadLocked;             // 07  - "ReadLocked"
      bool     ReadLocked_isValid;

      bool     WriteLocked;            // 08  - "WriteLocked"
      bool     WriteLocked_isValid;

      tUINT8   LockOnReset[32];        // 09  - "LockOnReset" (0-31, 0=PowerCycle, 1=Hardware, 2=HotPlug, 3=Programmatic, 4-15 reserved, 16-31 vendor unique)
      tINT8    LockOnReset_length;     // 0=empty (No Locking, or turning locking off), -1=Invalid

      TCG_UID  ActiveKey;              // 0A  - "ActiveKey"
      bool     ActiveKey_isValid;

      TCG_UID  NextKey;                // 0B  - "NextKey"
      bool     NextKey_isValid;

      tUINT8   ReEncryptState;         // 0C  - "ReEncryptState" (Read Only, 1-16)
      bool     ReEncryptState_isValid;

      tUINT8   ReEncryptRequest;       // 0D  - "ReEncryptRequest" (1-16)
      bool     ReEncryptRequest_isValid;

      tUINT8   AdvKeyMode;             // 0E  - "AdvKeyMode" (0-7)
      bool     AdvKeyMode_isValid;

      tUINT8   VerifyMode;             // 0F  - "VerifyMode" (0-7)
      bool     VerifyMode_isValid;

      tUINT8   ContOnReset[32];        // 10h - "ContOnReset" (0-31, 0=PowerCycle, 1=Hardware, 2=HotPlug, 3=Programmatic, 4-15 reserved, 16-31 vendor unique)
      tINT8    ContOnReset_length;     // 0=empty (No Locking, or turning locking off), -1=Invalid

      tUINT64  LastReEncryptLBA;       // 11h - "LastReEncryptLBA" (Read Only)
      bool     LastReEncryptLBA_isValid;

      tUINT8   LastReEncStat;          // 12h  - "LastReEncStat" (Read Only, 0-7)
      bool     LastReEncStat_isValid;

      tUINT8   GeneralStatus[64];      // 13h  - "GeneralStatus" (Read Only, 0-63)
      tINT8    GeneralStatus_length;   // -1=Invalid

      bool     AllowATAUnlock;         // 3Fh  - "AllowATAUnlock" (Seagate proprietary)
      bool     AllowATAUnlock_isValid;

      IOTableLocking( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTableLocking

   //====================================================================================
   /// \brief Data structure of selected columns from table C_PIN row.
   //====================================================================================
   struct IOTableC_PIN
   {
      TCG_UID  UID;                    // 00  - "UID"        (Read Only)
      bool     UID_isValid;

      tUINT8   Name[33];               // 01  - "Name"       (Read Only, max 32 bytes, 0-terminated)
      tINT8    Name_length;

      tUINT8   CommonName[33];         // 02  - "CommonName" (Read Only, max 32 bytes, 0-terminated)
      tINT8    CommonName_length;

      tUINT8   PIN[33];                // 03  - "PIN"        (max 32 bytes, 0-terminated)
      tINT8    PIN_length;

      TCG_UID  CharSet;                // 04  - "CharSet"    (Read Only in CS1.0)
      bool     CharSet_isValid;

      tUINT32  TryLimit;               // 05  - "TryLimit"
      bool     TryLimit_isValid;

      tUINT32  Tries;                  // 06  - "Tries"
      bool     Tries_isValid;

      bool     Persistence;            // 07  - "Persistence"
      bool     Persistence_isValid;

      IOTableC_PIN( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTableC_PIN

   //====================================================================================
   /// \brief Data structure of selected columns from table Authority row.
   //====================================================================================
   struct IOTableAuthority
   {
      TCG_UID  UID;                    // 00  - "UID"        (Read Only)
      bool     UID_isValid;

      tUINT8   Name[33];               // 01  - "Name"       (Read Only, max 32 bytes, 0-terminated)
      tINT8    Name_length;

      tUINT8   CommonName[33];         // 02  - "CommonName" (max 32 bytes, 0-terminated)
      tINT8    CommonName_length;

      bool     IsClass;                // 03  - "IsClass"    (Read Only in CS2.0)
      bool     IsClass_isValid;

      TCG_UID  Class;                  // 04  - "Class"
      bool     Class_isValid;

      bool     Enabled;                // 05  - "Enabled"
      bool     Enabled_isValid;

      tUINT8   Secure;                 // 06  - "Secure" (0-255)
      bool     Secure_isValid;

      tUINT8   HashAndSign;            // 07  - "HashAndSign" (0-15)
      bool     HashAndSign_isValid;

      bool     PresentCertificate;     // 08  - "PresentCertificate"
      bool     PresentCertificate_isValid;

      tUINT8   Operation;              // 09  - "Operation" (0-23)
      bool     Operation_isValid;

      TCG_UID  Credential;             // 0A  - "Credential"
      bool     Credential_isValid;

      TCG_UID  ResponseSign;           // 0B  - "ResponseSign"
      bool     ResponseSign_isValid;

      TCG_UID  ResponseExch;           // 0C  - "ResponseExch"
      bool     ResponseExch_isValid;

      tUINT16  ClockStart_Year;        // 0D  - "ClockStart"
      tUINT8   ClockStart_Month;       // 0D  - "ClockStart"
      tUINT8   ClockStart_Day;         // 0D  - "ClockStart"
      bool     ClockStart_isValid;

      tUINT16  ClockEnd_Year;          // 0E  - "ClockEnd"
      tUINT8   ClockEnd_Month;         // 0E  - "ClockEnd"
      tUINT8   ClockEnd_Day;           // 0E  - "ClockEnd"
      bool     ClockEnd_isValid;

      tUINT32  Limit;                  // 0F  - "Limit"
      bool     Limit_isValid;

      tUINT32  Uses;                   // 10h - "Uses"
      bool     Uses_isValid;

      tUINT8   Log;                    // 11h - "Log" (0-3)
      bool     Log_isValid;

      TCG_UID  LogTo;                  // 12h - "LogTo"
      bool     LogTo_isValid;

      IOTableAuthority( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTableAuthority

   //====================================================================================
   /// \brief Data structure of selected columns from table MBRControl row.
   //====================================================================================
   struct IOTableMBRControl
   {
      TCG_UID  UID;                    // 00  - "UID"        (Read Only)
      bool     UID_isValid;

      bool     Enable;                 // 01  - "Enable"
      bool     Enable_isValid;

      bool     Done;                   // 02  - "Done"
      bool     Done_isValid;

      tUINT8   MBRDoneOnReset[32];     // 03  - "MBRDoneOnReset" (0-31, 0=PowerCycle, 1=Hardware, 2=HotPlug, 3=Programmatic, 4-15 reserved, 16-31 vendor unique)
      tINT8    MBRDoneOnReset_length;  // 0=empty (No change to 'Done' upon any reset), -1=Invalid

      IOTableMBRControl( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTableMBRControl

   //====================================================================================
   /// \brief Data structure of selected columns from table _PortLocking (Seagate Proprietary) row.
   //====================================================================================
   struct IOTable_PortLocking
   {
      TCG_UID  UID;                    // 00  - "UID"        (Read Only)
      bool     UID_isValid;

      tUINT8   Name[33];               // 01  - "Name"       (Read Only, max 32 bytes, 0-terminated)
      tINT8    Name_length;

      tUINT8   LockOnReset[32];        // 02  - "LockOnReset" (0-31, 0=PowerCycle, 1=Hardware, 2=HotPlug, 3=Programmatic, 4-15 reserved, 16-31 vendor unique)
      tINT8    LockOnReset_length;     // 0=empty (No Locking, or turning locking off), -1=Invalid

      bool     PortLocked;             // 03  - "PortLocked"
      bool     PortLocked_isValid;

      IOTable_PortLocking( bool toGet =false ) { setStateAll( toGet ); }
      void setStateAll( bool valid );
      bool isEmpty();
   }; // IOTable_PortLocking


   //=================================
   // class definitions
   //=================================

   //====================================================================================
   /// \brief An Interface abstract class which defines a set of TCG generic functions.
   ///
   /// ITCGInterface is a derived class from CDriveTrustInterface which provides the
   /// implementation for the parent class' methods.
   //====================================================================================
   class ITCGInterface : virtual public CDriveTrustInterface
   {
   public:
      //=================================================================================
